Revit 2027 API
Application.NewCurveLoopsProfile Method
Creates a new CurveLoopsProfile object.
Namespace: Autodesk.Revit.Creation
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public CurveLoopsProfile NewCurveLoopsProfile(
	CurveArrArray curveLoops
)
Public Function NewCurveLoopsProfile (
	curveLoops As CurveArrArray
) As CurveLoopsProfile
public:
CurveLoopsProfile^ NewCurveLoopsProfile(
	CurveArrArray^ curveLoops
)
member NewCurveLoopsProfile :
        curveLoops : CurveArrArray -> CurveLoopsProfile
Parameters
curveLoops CurveArrArray
The curve loops of the Profile.
Return Value
CurveLoopsProfile
The new CurveLoopsProfile object.
Exceptions
Exception | Condition
ArgumentNullException |  Thrown when the argument is null.
See Also
Reference
Application Class
Autodesk.Revit.Creation Namespace